print("""
КОНЦЕПЦИЯ ООП, состоит из трех главных элементов:
- инкапсуляция
- наследование
- полиморфизм

Инкапсуляция
Благодаря инкапсуляции мы храним в одном месте все данные и методы,
которые и определяют внутренний алгоритм функционирования данного класса
(Данные и методы можно скрывать, чтобы пользователь не мог вмешаться
во внутреннюю работу класса)

Наследование
Благодаря механизму наследования классов,
мы можем использовать ранее созданные классы и расширять их функциональность.

Полиморфизм
Благодаря параметрическому полиморфизму,
мы можем оперировать разными типами объектов через их единый базовый класс
""")